trade_exp/src/InformationRegisters/ЧерныйСписокКонтактов/ЧерныйСписокКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c401f29d-dc39-464e-9e33-484e3a027e14">
  <name>ЧерныйСписокКонтактов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="4b7610f3-e507-4d1b-b2d4-475c338981ab">
    <name>КонтактныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="fa319de3-3094-443c-b8f0-1b3ab6c81d1d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c7e0bb70-a2e6-43e1-b2ac-14a2265c58b5">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЧерныйСписокКонтактов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

 Процедура ДобавитьЗапись(Телефон, Комментарий, Ответственный)   Экспорт
	УстановитьПривилегированныйРежим(Истина); 
	НаборЗапись = РегистрыСведений.ЧерныйСписокКонтактов.СоздатьНаборЗаписей();
	НаборЗапись.Отбор.КонтактныеДанные.Установить(Телефон);
	НаборЗапись.Прочитать();
	Если НаборЗапись.Количество() = 0 Тогда
	    ЗаписьВРегистр = НаборЗапись.Добавить();
		ЗаписьВРегистр.КонтактныеДанные = Телефон;
		ЗаписьВРегистр.Ответственный = Ответственный;
		ЗаписьВРегистр.Комментарий = Комментарий;
		НаборЗапись.Записать(Истина); 
	КонецЕсли; 
    УстановитьПривилегированныйРежим(Ложь); 
КонецПроцедуры



#КонецЕсли
